Revit 2027 API
BalusterPlacement.BalusterPattern Property
 Accesses the object containing properties related to the baluster pattern.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BalusterPattern BalusterPattern { get; }
Public ReadOnly Property BalusterPattern As BalusterPattern
	Get
public:
property BalusterPattern^ BalusterPattern {
	BalusterPattern^ get ();
}
member BalusterPattern : BalusterPattern with get
Property Value
BalusterPattern
See Also
Reference
BalusterPlacement Class
Autodesk.Revit.DB.Architecture Namespace